import telebot
from datetime import datetime

tg_token = '6627394164:AAHOSe5nb6ZYM3Tbt2VnvXuEXh5S4-898hs'

bot = telebot.TeleBot(tg_token)

last_age_update = datetime.now().date()

sleeping = False
wait_time = 60

last_feed_times = {}
last_clean_times = {}
last_play_times = {}
last_work_time = {}
last_casino_time = {}

# казиныч
red_numbers = [2, 4, 6, 8, 10, 11, 13, 15, 17, 20, 22, 24, 26, 28, 29, 31, 33, 35]
black_numbers = [1, 3, 5, 7, 9, 12, 14, 16, 18, 19, 21, 23, 25, 27, 30, 32, 34, 36]
st_12 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
nd_12 = [13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24]
rd_12 = [25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36]
_2_to_1_34 = [1, 4, 7, 10, 13, 16, 19, 22, 25, 28, 31, 34]
_2_to_1_35 = [2, 5, 8, 11, 14, 17, 20, 23, 26, 29, 32, 35]
_2_to_1_36 = [3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36]
_1_to_18 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18]
_19_to_36 = [19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36]

# Клиенты в пельменную
strict_clients = ['Леон', 'Диана', 'Артур', 'Нэнси', 'Амелия', 'Макс', 'Елизавет', 'Карл', 'Сергей',
                  'Ольга', 'Николай', 'Мария', 'Владимир', 'Елена', 'Андрей', 'Алина', 'Павел', 'София', 'Константин',
                  'Антон', ]
not_strict_clients = ['Эмиль', 'Аделаид', 'Леонид', 'Скарлет', 'Габриэль', 'Ханна', 'Теодор', 'Эльза', 'Феликс',
                      'Амелия', 'Оскар', 'Юлия', 'Максимилиан', 'Лариса', 'Артурито', 'Джасмин', 'Август', 'Жозефина',
                      'Кирилл', 'Эвелина']
nice_clients = ['Александр', 'Екатерина', 'Михаил', 'Людмила', 'Иван', 'Анна', 'Дмитрий', 'Татьяна', 'Ева', 'Хьюго',
                'Ирина', 'Хантер', 'Алисия', 'Вадим', 'Клара', 'Ангел', 'Оксана', 'Лиам', 'Софи', 'Филипп']
# Проблемы на плантации
farm_problems = ['На плантации не посажено ни одного куста', 'Засуха', 'Плантация заросла сорняком', 'Некоторые кусты '
                 'покрылись плесенью и грибком', 'На данной плантации обильные кусты мяты', 'Кусты долгое время не могу'
                 'т вырасти']
